tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "arduino-cli"
brew "automake"
brew "bat"
brew "gettext"
brew "cmake"
brew "curl"
brew "entr"
brew "eza"
brew "gcc"
brew "ffmpeg"
brew "fzf"
brew "llvm"
brew "ncurses"
brew "neovim"
brew "ninja"
brew "openjdk"
brew "pkg-config"
brew "py3cairo"
brew "python@3.11"
brew "reattach-to-user-namespace"
brew "scipy"
brew "tmux"
brew "zoxide"
brew "hashicorp/tap/packer"
cask "mactex-no-gui"
cask "rectangle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "edonet.vscode-command-runner"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "helixquar.randomeverything"
vscode "ibm.output-colorizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mvllow.rose-pine"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "znck.grammarly"
