tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "osx-cross/avr"
brew "arduino-cli"
brew "autoconf-archive"
brew "automake"
brew "avrdude"
brew "bat"
brew "biome"
brew "gettext"
brew "python@3.12"
brew "ncurses"
brew "cbonsai"
brew "ccls"
brew "cjson"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "curl"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "gcc"
brew "fftw"
brew "fortune"
brew "fswatch"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "go"
brew "libtool"
brew "imagemagick"
brew "iniparser"
brew "jq"
brew "lsusb"
brew "lua"
brew "luarocks"
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "nmap"
brew "openjdk"
brew "pipenv"
brew "pipes-sh"
brew "pkg-config"
brew "pkgconf"
brew "portaudio"
brew "py3cairo"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "scipy"
brew "silicon"
brew "sl"
brew "starship"
brew "tmux"
brew "tokei"
brew "wget"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/packer"
brew "jesseduffield/lazygit/lazygit"
brew "osx-cross/avr/avr-binutils"
brew "osx-cross/avr/avr-gcc@9"
cask "1password-cli"
cask "aerospace"
cask "alt-tab"
cask "iterm2"
cask "kitty"
cask "neovide"
cask "raycast"
cask "skim"
cask "stats"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "edonet.vscode-command-runner"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "helixquar.randomeverything"
vscode "ibm.output-colorizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mvllow.rose-pine"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wix.glean"
vscode "znck.grammarly"
