tap "discoteq/discoteq"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "osrf/simulation"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "px4/px4"
tap "qmk/qmk"
brew "freetype"
brew "openssl@3"
brew "readline"
brew "python@3.13"
brew "openjdk"
brew "protobuf"
brew "apache-arrow"
brew "asio"
brew "assimp"
brew "bat"
brew "spdlog"
brew "bear"
brew "bullet"
brew "ncurses"
brew "cbonsai"
brew "ccls"
brew "eigen"
brew "pkgconf"
brew "cjson"
brew "cmake"
brew "cmatrix"
brew "console_bridge"
brew "libsodium"
brew "tinyxml2"
brew "eza"
brew "fd"
brew "python@3.12"
brew "ffmpeg"
brew "fzf"
brew "libheif"
brew "gdal"
brew "gh"
brew "graphviz"
brew "gstreamer"
brew "imagemagick"
brew "lld"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "node"
brew "opencv"
brew "php"
brew "python-tk@3.13"
brew "qt@5"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tokei"
brew "wb32-dfu-updater_cli"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "jesseduffield/lazygit/lazygit"
brew "osrf/simulation/tinyxml1"
brew "osx-cross/avr/avr-gcc@9"
brew "px4/px4/px4-dev"
brew "px4/px4/px4-sim"
brew "qmk/qmk/qmk"
cask "adguard-vpn"
cask "ghdl"
cask "miniconda"
cask "qmk-toolbox"
cask "stats"
cask "xquartz"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "edonet.vscode-command-runner"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "helixquar.randomeverything"
vscode "ibm.output-colorizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mvllow.rose-pine"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.gruvbox-material"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wix.glean"
vscode "znck.grammarly"
